[{"url": "https://en.wikipedia.org/wiki/Tennis", 
  "text": "Tennis is a racket sport that can be played individually against a single opponent (singles) or between two teams of two players each (doubles). Each player uses a tennis racket that is strung with cord to strike a hollow rubber ball covered with felt over or around a net and into the opponent's court. The object of the game is to play the ball in such a way that the opponent is not able to play a valid return. The player who is unable to return the ball will not gain a point, while the opposite player will.Tennis is an Olympic sport and is played at all levels of society and at all ages. The sport can be played by anyone who can hold a racket, including wheelchair users. The modern game of tennis originated in Birmingham, England, in the late 19th century as \"lawn tennis\".[1] It had close connections both to various field (\"lawn\") games such as croquet and bowls as well as to the older racket sport of real tennis. During most of the 19th-century in fact, the term \"tennis\" referred to real tennis, not lawn tennis: for example, in Disraeli's novel Sybil (1845), Lord Eugene De Vere announces that he will \"go down to Hampton Court and play tennis.\"[2]The rules of tennis have changed little since the 1890s. Two exceptions are that from 1908 to 1961 the server had to keep one foot on the ground at all times, and the adoption of the tiebreak in the 1970s. A recent addition to professional tennis has been the adoption of electronic review technology coupled with a point challenge system, which allows a player to contest the line call of a point.Tennis is played by millions of recreational players and is also a popular worldwide spectator sport. The four Grand Slam tournaments (also referred to as the \"Majors\") are especially popular: the Australian Open played on hard courts, the French Open played on red clay courts, Wimbledon played on grass courts, and the US Open played also on hard courts.", 
  "title": "Tennis"},
{"url": "https://en.wikipedia.org/wiki/History_of_tennis",
  "text": "The game that most people call tennis is the direct descendant of what is now known as real tennis or royal tennis (which continues to be played today as a separate sport with more complex rules). Most of the rules of the game commonly known as tennis derive from real or royal tennis. It is reasonable to see both sports as variations of the same game. Most historians believe that tennis originated in the monastic cloisters in northern France in the 12th century, but the ball was then struck with the palm of the hand hence the name jeu de paume (\"game of the palm\").[1] It was not until the 16th century that rackets came into use, and the game began to be called \"tennis.\" It was popular in England and France and Henry VIII of England was a big fan of the game, now referred to as real tennis.[2]Many original tennis courts remain, including courts at Oxford, Cambridge and Hampton Court Palace. Many of the French courts were decommissioned with the terror that accompanied the French Revolution. The Tennis Court Oath (Serment du Jeu de Paume) was a pivotal event during the first days of the French Revolution. The Oath was a pledge signed by 576 of the 577 members from the Third Estate who were locked out of a meeting of the Estates-General on 20 June 1789. Any history of tennis that ignores its origins in the game that was (and is still in certain circles) known as tennis until \"lawn tennis\" became popular in the late nineteenth century is inaccurate.The Davis Cup, an annual competition between men's national teams, dates to 1900.[3] The analogous competition for women's national teams, the Fed Cup, was founded as the Federation Cup in 1963 to celebrate the 50th anniversary of the founding of the International Tennis Federation, also known as the ITF.In 1926, promoter C.C. Pyle created the first professional tennis tour with a group of American and French tennis players playing exhibition matches to paying audiences.[4][5] The most notable of these early professionals were the American Vinnie Richards and the Frenchwoman Suzanne Lenglen.[4][6] Once a player turned pro he or she could not compete in the major (amateur) tournaments.[4]In 1968, commercial pressures and rumors of some amateurs taking money under the table led to the abandonment of this distinction, inaugurating the \"open era\", in which all players could compete in all tournaments, and top players were able to make their living from tennis.[7] With the beginning of the open era, the establishment of an international professional tennis circuit, and revenues from the sale of television rights, tennis's popularity has spread worldwide, and the sport has shed its upper/middle-class English-speaking image[8] (although it is acknowledged that this stereotype still exists).[8][9][10]The word \"Tennis\" came into use in English in the mid-13th century from Old French, via the Anglo-Norman term Tenez, which can be translated as \"hold!\", \"receive!\" or \"take!\". A call from the server to his opponent indicating that he is about to serve.[11] The first known appearance of the word in English literature is by poet John Gower in his poem titled 'In Praise of Peace' dedicated to King Henry IV and composed in 1400; \"Of the tenetz to winne or lese a chase, Mai no lif wite er that the bal be ronne\". (Whether a chase is won or lost at tennis, Nobody can know until the ball is run).[a][13][14][15][16]Tennis is mentioned in literature as far back as the Middle Ages. In The Second Shepherds' Play (c. 1500) shepherds gave three gifts, including a tennis ball, to the newborn Christ. Sir Gawain, a knight of King Arthur's round table, plays tennis against a group of 17 giants in The Turke and Gowin (c. 1500).[17][18]The Medieval form of tennis is termed as real tennis. Real tennis evolved over three centuries, from an earlier ball game played around the 12th century in France which involved hitting a ball with a bare hand and later with a glove.[19][20] By the 16th century, the glove had become a racquet, the game had moved to an enclosed playing area, and the rules had stabilized. Real tennis spread in popularity throughout royalty in Europe, reaching its peak in the 16th century.In 1437 at the Blackfriars, Perth, the playing of tennis indirectly led to the death of King James I of Scotland, when the drain outlet, through which he hoped to escape assassins, had been blocked to prevent the loss of tennis balls.[21] James was trapped and killed.[22]Francis I of France (1515–47) was an enthusiastic player and promoter of real tennis, building courts and encouraging play among the courtiers and commoners. His successor Henry II (1547–59) was also an excellent player and continued the royal French tradition. In 1555 an Italian priest, Antonio Scaino da Salothe, wrote the first known book about tennis, Trattato del Giuoco della Palla. Two French kings died from tennis related episodes—Louis X of a severe chill after playing and Charles VIII after hitting his head during a game.[23] King Charles IX granted a constitution to the Corporation of Tennis Professionals in 1571, creating the first pro tennis 'tour', establishing three professional levels: apprentice, associate, and master. A professional named Forbet wrote and published the first codification of the rules in 1599.[24]Royal interest in England began with Henry V (1413–22.) Henry VIII (1509–47) made the biggest impact as a young monarch; playing the game with gusto at Hampton Court on a court he built in 1530. It is believed that his second wife Anne Boleyn was watching a game when she was arrested and that Henry was playing when news of her execution arrived. During the reign of James I (1603–25), London had 14 courts.[25]Real tennis is mentioned in literature by William Shakespeare who mentions \"tennis balles\" in Henry V (1599), when a basket of them is given to King Henry as a mockery of his youth and playfulness; the incident is also mentioned in some earlier chronicles and ballads.[26] One of the most striking early references appears in a painting by Giambattista Tiepolo entitled The Death of Hyacinth (1752–1753) in which a strung racquet and three tennis balls are depicted. The painting's theme is the mythological story of Apollo and Hyacinth, written by Ovid. Giovanni Andrea dell'Anguillara translated it into Italian in 1561 and replaced the ancient game of discus, in the original text with pallacorda or tennis, which had achieved a high status at the courts in the middle of the 16th century. Tiepolo's painting, displayed at the Museo Thyssen Bornemisza in Madrid, was ordered in 1752 by German count Wilhelm Friedrich Schaumburg Lippe, who was an avid tennis player.The game thrived among the 17th-century nobility in France, Spain, Italy, and in the Austro-Hungarian Empire, but suffered under English Puritanism. By the Age of Napoleon, the royal families of Europe were besieged and real tennis was largely abandoned.[27] Real tennis played a minor role in the history of the French Revolution, through the Tennis Court Oath, a pledge signed by French deputies on a real tennis court, which formed a decisive early step in starting the revolution. In England, during the 18th and early 19th centuries as real tennis died out, three other racquet sports emerged: racquets, squash racquets, and lawn tennis (the modern game).The modern sport is tied to two separate inventions.Between 1859 and 1865, in Birmingham, England, Major Harry Gem, a solicitor, and his friend Augurio Perera, a Spanish merchant, combined elements of the game of rackets and the Spanish ball game Pelota and played it on a croquet lawn in Edgbaston.[28][29] In 1872, both men moved to Leamington Spa and in 1874, with two doctors from the Warneford Hospital, founded the world's first tennis club, the Leamington Tennis Club.[30]In December 1873, Major Walter Clopton Wingfield designed and patented a similar game—which he called Sphairistikè (Greek: σφάίρίστική, from ancient Greek meaning \"skill at playing at ball\"), and was soon known simply as \"sticky\"—for the amusement of his guests at a garden party on his estate of Nantclwyd, in Llanelidan, Wales.[31][32] He likely based his game on the evolving sport of outdoor tennis including real tennis. Much of modern tennis terminology also derives from this period, as Wingfield borrowed both the name and much of the French vocabulary of real tennis and applied them to his new game.[33] He patented the game [34] in 1874 with an eight-page rule book titled \"Sphairistike or Lawn Tennis\",[35] but he failed to succeed in enforcing his patent.[36] In his version the game was played on an hour-glass shaped court and the net was higher (4 feet 8 inches). The service had to be made from a diamond-shaped box at one end only and the service had to bounce beyond the service line instead of in front of it. He adopted the Rackets-based system of scoring where games consisted of 15 points (called 'aces').[37]Mary Ewing Outerbridge played the game in Bermuda at \"Clermont\", a house with a spacious lawn in Paget parish.[38] In 1874 Mary returned from Bermuda aboard the ship \"S.S. Canima\" and introduced lawn tennis to the United States.[39] She set up the first tennis court in the United States on the grounds of the Staten Island Cricket and Baseball Club, which was near where the Staten Island Ferry Terminal is today.[40] The club was founded on or about March 22, 1872. She played the first tennis game in the US against her sister Laura in Staten Island, New York, on an hourglass-shaped court.[40]Wingfield borrowed both the name and much of the French vocabulary of real tennis:The four Majors or Grand Slam tournaments, the four biggest competitions on the tennis circuit, are Wimbledon, the US Open, the French Open, and the Australian Open. Since the mid 1920s they became and have remained the most prestigious events in tennis.[4][47] Winning these four tournaments in the same year is called the Grand Slam (a term borrowed from bridge).[48]The Championships, Wimbledon, were founded by the All England Club in 1877 to raise money for the club.[49] The first Championships were contested by 22 men and the winner received a Silver Gilt Cup proclaiming the winner to be \"The All England Lawn Tennis Club Single Handed Champion of the World\".[50] The first Championships culminated a significant debate on how to standardize the rules. The following year it was recognized as the official British Championships, although it was open to international competitors. In 1884 the Ladies Singles and Gentlemen's Doubles Championships were inaugurated, followed by the Ladies and Mixed Doubles in 1913.",
  "title": "History of tennis"}]